package homework;

public class Tasks {
    void task1() {
         /*
        Вам надо разработать 2 теста, сценарий для каждого теста я вам уже придумал и запишу ниже.

        Все тесты должны быть разработаны с использованием PageObject pattern и Selenide

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://devby.io/
         - Нажать на иконку меню (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Выбрать пункт меню "Компании" (На скрине img_2 вы найдёте под пунктом 1 элемент из этого шага).
         - Ввести в поле поиска компании 'bit' (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверьте, что компания 'Fitbit' найдена. (На скрине img_3 вы найдёте под пунктом 2 элемент из этого шага).
         - Проверьте, что количество сотрудников компании больше 0. (На скрине img_3 вы найдёте под пунктом 3 элемент из этого шага).
         - Проверьте, что компания в списке выше, чем Fitbit имеет сотрудников больше 0. (На скрине img_3 вы найдёте под пунктом 4 элемент из этого шага).
         - Проверьте, что компания в списке ниже, чем Fitbit имеет сотрудников больше 0. (На скрине img_3 вы найдёте под пунктом 5 элемент из этого шага).

        Второй тест.

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://devby.io/
         - Нажать на иконку меню (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Выбрать пункт меню "Компании" (На скрине img_2 вы найдёте под пунктом 1 элемент из этого шага).
         - Ввести в поле поиска компании 'solution' (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверьте, что компания 'BIMSOLUTIONS' найдена.
         - Проверьте, что количество сотрудников компании больше 0.
         - Проверьте, что компания в списке выше, чем BIMSOLUTIONS имеет сотрудников больше 0.
         - Проверьте, что компания в списке ниже, чем BIMSOLUTIONS имеет сотрудников больше 0.


         Подумайте, как записать эти 2 теста в одном тестовом методе с использованием датапровайдера.
         Эти тесты должны запускаться параллельно.
         Если вы сделаете 2 разных тестовых метода для компании Fitbit и BIMSOLUTIONS, то такое решение не будет засчитано.
         */
    }

    void task2() {
         /*
        Вам надо разработать 1 тест, сценарий для теста я вам уже придумал и запишу ниже.

        Тест должен быть разработан с использованием PageObject pattern и Selenide

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://devby.io/
         - Нажать на иконку меню (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Нажать на ссылку "О проекте" (На скрине img_4 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверьте, что заголовок 'О проекте' виден. (На скрине img_5 вы найдёте под пунктом 1 элемент из этого шага).
         */
    }

    void task3() {
        /*
        Вам надо разработать 1 тест, сценарий для теста я вам уже придумал и запишу ниже.

        Тест должен быть разработан с использованием PageObject pattern и Selenide.

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://devby.io/
         - Нажать на иконку меню (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Ввести в поле поиска слово "selenium" и нажать на кнопку поиска (На скрине img_6 вы найдёте под пунктом 1 и 2 элементы из этого шага).
         - Проверьте, что после поиска у вас текущий url начинается на "https://cse.google.com/".
         */
    }
}