package homework;

public class Tasks {
    void task1() {
        /*
        Вам надо разработать 6 тестов, сценарий для каждого теста я вам уже придумал и запишу ниже.

        Все тесты должны быть разработаны с использованием PageObject pattern (PageFactory на ваше усмотрение)

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://myfin.by/
         - В навигационном меню сайта выберите пункт "Курсы валют" (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Нажать кнопку "Конвертер" (На скрине img_2 вы найдёте под пунктом 1 элемент из этого шага).
         - Установить значение 200 для поля usd (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверьте, что поле usd содержит то значение, которое вы установили. (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).

        Второй тест.

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://myfin.by/
         - В навигационном меню сайта выберите пункт "Курсы валют" (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Нажать кнопку "Конвертер" (На скрине img_2 вы найдёте под пунктом 1 элемент из этого шага).
         - Установить значение 2040 для поля byn (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверьте, что поле usd содержит то значение, которое вы установили. (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).

        Третий тест.

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://myfin.by/
         - В навигационном меню сайта выберите пункт "Курсы валют" (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Нажать кнопку "Конвертер" (На скрине img_2 вы найдёте под пунктом 1 элемент из этого шага).
         - Установить значение 70777 для поля rub (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверьте, что поле usd содержит то значение, которое вы установили. (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).

        Четвёртый тест.

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://myfin.by/
         - В навигационном меню сайта выберите пункт "Курсы валют" (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Нажать кнопку "Конвертер" (На скрине img_2 вы найдёте под пунктом 1 элемент из этого шага).
         - Установить значение 256 для поля cny (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверьте, что поле usd содержит то значение, которое вы установили. (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).

        Пятый тест.

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://myfin.by/
         - В навигационном меню сайта выберите пункт "Курсы валют" (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Нажать кнопку "Конвертер" (На скрине img_2 вы найдёте под пунктом 1 элемент из этого шага).
         - Установить значение 888 для поля pln (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверьте, что поле usd содержит то значение, которое вы установили. (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).

        Шестой тест.

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://myfin.by/
         - В навигационном меню сайта выберите пункт "Курсы валют" (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Нажать кнопку "Конвертер" (На скрине img_2 вы найдёте под пунктом 1 элемент из этого шага).
         - Установить значение 270 для поля eur (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверьте, что поле usd содержит то значение, которое вы установили. (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).


         Подумайте, как записать эти 6 тестов в одном тестовом методе с использованием датапровайдера.
         Эти тесты должны запускаться параллельно.
         Если вы сделаете 6 разных тестовых метода для каждой валюты, то такое решение не будет засчитано.
         */
    }

    void task2() {
    /*
        Вам надо разработать 1 тест, сценарий для теста я вам уже придумал и запишу ниже.

        Тест должен быть разработан с использованием PageObject pattern (PageFactory на ваше усмотрение)

         Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://myfin.by/
         - В навигационном меню сайта выберите пункт "Курсы валют" (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - В навигационном меню сайта выберите пункт "Вклады" (На скрине img_4 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверьте, что текст "Колебания ставок на вклады" виден. (На скрине img_4 вы найдёте под пунктом 2 элемент из этого шага).

     */
    }

    void task3() {
         /*
        Вам надо разработать 1 тест, сценарий для теста я вам уже придумал и запишу ниже.

        Тест должен быть разработан с использованием PageObject pattern и PageFactor.
        Вам необходимо создать кастомный WebElement для кнопки "Далее". На занятии мы разбирали как это делать, смотрите запись занятия, пробуйте.

        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://myfin.by/
         - В навигационном меню сайта выберите пункт "Курсы валют" (На скрине img_1 вы найдёте под пунктом 1 элемент из этого шага).
         - Нажать на кнопку "Забронировать курс" (На скрине img_5 вы найдёте под пунктом 1 элемент из этого шага).
         - Ввести в поле У меня есть значение "200" (На скрине img_6 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверьте, что кнопка "Далее" видна. (На скрине img_6 вы найдёте под пунктом 2 элемент из этого шага).
         */
    }
}