package homework;

public class Tasks {
    void task1() {
        /*
        Создайте любой REST API тест на свой вкус, например отправить гет запрос куда-то и проверить, что стату код 200.
         */
    }

    void task2() {
        /*
        Создайте любой UI тест на свой вкус и проверить, что текущий url соответствует тому что вы вводили.
         */
    }

    void task3() {
        /*
        Создайте job в Jenkins.
        Забиндите этот job на ваш репозиторий.
        Запустите с помощью этой job ваши тесты из task1 и task2.
        Вконце у вас должен быть доступен из workspace отчёт с результатами тестов.
         */
    }
}