package homework;

public class Tasks {
    void task1() {
        /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://about.gitlab.com/
         - Кликнуть на выпадающий список 'Resources' в навигационном меню сайта (На скрине img_7 вы найдёте под пунктом 1 элемент из этого шага).
         - Кликнуть по пункту меню 'Quick start guides' (На скрине img_7 вы найдёте под пунктом 2 элемент из этого шага).
         - Кликнуть на кнопку 'Watch a demo' (На скрине img_8 вы найдёте под пунктом 1 элемент из этого шага).
         - Переключитесь на frame с видео. (На скрине img_3 вы найдёте под пунктом 1 элемент из этого шага).
         - Нажмите кнопку 'Play' внутри фрейма с видео (На скрине img_4 вы под пунктом 1 элемент из этого шага).
         - Проверьте, что кнопка 'Pause' видна (На скрине img_9 вы под пунктом 1 элемент из этого шага).
         */

    }

    void task2() {
     /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://about.gitlab.com/
         - Кликнуть на вкладку 'Platform' (На скрине img_5 вы найдёте под пунктом 1 элемент из этого шага).
         - Проверить, что кнопка 'Get free trial' видна (На скрине img_5 вы найдёте под пунктом 2 элемент из этого шага).
         */
    }

    void task3() {
        /*
        Вам надо разработать 1 тест, сценарий для этого теста я вам уже придумал и запишу ниже.
        Шаги:
         - Развернуть окно браузера на весь экран
         - Перейдите на сайт https://about.gitlab.com/
         - Проверить, что 3 картинки на главной странице имеют расширение .svg (На скрине img_6 найдёт область в которой надо проверять картинки).
         */
    }
}